"""
3. По введенным пользователем координатам двух точек
вывести уравнение прямой вида y=kx+b, проходящей через эти точки.
"""
a1_x = float(input("Первая точка, координата x: "))
a1_y = float(input("Первая точка, координата y: "))
a2_x = float(input("Вторая точка, координата x: "))
a2_y = float(input("Вторая точка, координата y: "))

a1 = [a1_x, a1_y]
a2 = [a2_x, a2_y]

if a1 == a2:
    print("Введите несовпадающие точки.")
else:
    k = (a1[1] - a2[1]) / (a1[0] - a2[0])
    b = a2[1] - k * a2[0]
    print("Уравнение прямой вида y=kx+b, проходящей через эти точки: ")
    print(f" y = {k}*x + {b}")
